## 시리즈 인덱싱

In [96]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])

s[0] # 9904312
s['서울'] #9904312

# 다음은 비문이다.
# s[0, 1]

# 인덱싱을 할 때는 : 를 이용하거나 [[]] 꼴로 해야한다. 아래 두 개는 결과가 같다.
s[0:2] # 서울, 부산
s[[0, 1]] #서울, 부산

서울    9904312
부산    3448737
dtype: int64

## 시리즈와 딕셔너리

In [98]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])

"인천" in s #True

# .items() 메소드 사용가능
for key, value in s.items():
    print("%s = %d"%(key, value))

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

## 데이터 갱신, 추가, 삭제

In [103]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])

# 데이터 추가
s["대전"] = 2489712

# 데이터 갱신
s["서울"] = 3456785

# 데이터 삭제
del s["부산"]

서울    3456785
인천    2890451
대구    2466052
대전    2489712
dtype: int64

## 연습 문제 4.1.1

(1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [18]:
import pandas as pd

# (1) 임의의 두 개의 시리즈 객체 만들기
x = pd.Series([100, 98, 60, 70], index = ["국어", "영어", "수학", "과학"])
y = pd.Series([98, 50, 84, 89], index = ["국어", "영어", "수학", "사회"])

# (2) 두 시리즈 객체를 이용하여 사칙 연산을 한다.
# 더하기
plus = x + y

# 삐기
minus = x - y

# 곱하기
multi = x * y

# 나누기
div = x / y

## 연습 문제 4.1.2

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [22]:
import pandas as pd

data = {
    "종가" : [83900, 130500, 893000, 832000, 292500],
    "종목명" : ["삼성전자", "SK하이닉스", "LG화학", "삼성바이오로직스", "NAVER"],
    "PER" : [22.91, 33.11, 83.43, 154.91, 58.23],
    "ROE" : [8.69, 4.25, 1.84, 4.77, 10.56],
    "등락률" : [1.08, 3.57, 0.45, 0.36, -0.17]
}
columns = ["종목명", "종가", "등락률", "PER", "ROE"]
index = ["005830", "000660", "051910", "207940", "035420"]

df = pd.DataFrame(data, index = index, columns = columns)
df

             종목명      종가   등락률     PER    ROE
005830      삼성전자   83900  1.08   22.91   8.69
000660    SK하이닉스  130500  3.57   33.11   4.25
051910      LG화학  893000  0.45   83.43   1.84
207940  삼성바이오로직스  832000  0.36  154.91   4.77
035420     NAVER  292500 -0.17   58.23  10.56

## 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

(5) 춘향의 점수를 데이터프레임으로 나타낸다.

(6) 향단의 점수를 시리즈로 나타낸다.

In [82]:
import pandas as pd

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
series_m = df["수학"]

# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df_kor_eng = df[["국어", "영어"]]

# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df["각 과목 평균 점수"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round(2)

# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
# 데이터의 갱신은 열 단위로 할 수 있다.
df['영어'] = [90, 70, 60, 80]
df["각 과목 평균 점수"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round(2)

# 아래와 같이 개별적으로 바꾸는 것은 SettingWithCopyWarning 오류 메시지가 뜬다.
# df['영어']['방자'] = 80 


# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
# 행 데이터는 정수 슬라이싱으로 할 수 있다.
df[:1] 

# (6) 향단의 점수를 시리즈로 나타낸다.
# 시리즈로 추출하는 것은 열 인덱싱을 했을 때 가능하기 때문에 .T로 전치처리를 해주어야 한다.
df.T['향단']

국어            70.0
영어            60.0
수학            80.0
각 과목 평균 점수    70.0
Name: 향단, dtype: float64

In [90]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])

s[1:3]

부산    3448737
인천    2890451
dtype: int64

# 데이터 입출력

## 데이터 생성

%%writefile 파일이름.csv

In [7]:
%%writefile sample1.csv
열1, 열2, 열3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample1.csv

## 데이터 입력

### pd.read_csv('파일이름.csv') 사용

In [8]:
import pandas as pd

# 행 인덱스와 열 인덱스 모두 지정해주지 않으면 행 인덱스는 0부터 자동으로 매겨지고 열 인덱스는 첫 번째 행이 된다.
pd.read_csv("sample1.csv")

# 행 인덱스 설정
# c1 열이 행 인덱스로 설정된다.
pd.read_csv('sample1.csv', index_col = '열1')

# 열 인덱스 설정
# names 리스트가 열 인덱스로 설정된다.
pd.read_csv('sample1.csv', names= ['1열','2열','3열'])

   1열     2열      3열
0  열1     열2      열3
1   1   1.11     one
2   2   2.22     two
3   3   3.33   three

### skiprows 사용

In [2]:
import pandas as pd

# 첫번째 행 제외
pd.read_csv('sample1.csv', skiprows = [0], names = ['1열', '2열', '3열'])

   1열    2열      3열
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

### na_values 사용

In [3]:
import pandas as pd

# 1.11 을 NaN으로 처리하려 읽어온다.
pd.read_csv('sample1.csv', skiprows = [0], names = ['1열', '2열', '3열'], na_values=['1.11'])

   1열    2열      3열
0   1   NaN     one
1   2  2.22     two
2   3  3.33   three

### datareader 패키지 사용

In [4]:
import datetime
dt_start = datetime.datetime(2020, 1, 1)
dt_end = datetime.datetime(2021, 1, 5)

import pandas_datareader as pdr

gdp = pdr.get_data_fred('GDP', dt_start, dt_end)
gdp.tail()

                  GDP
DATE
2020-01-01  21561.139
2020-04-01  19520.114
2020-07-01  21170.252

## 데이터 출력

 데이터 출력

### pd.to_csv('파일이름.csv') 사용

In [6]:
import datetime
dt_start = datetime.datetime(2020, 1, 1)
dt_end = datetime.datetime(2021, 1, 5)

import pandas_datareader as pdr

gdp = pdr.get_data_fred('GDP', dt_start, dt_end)
gdp.tail()

gdp.to_csv('gdp.csv')

## 연습문제 4.3.1
1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [9]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.arange(10, 35).reshape(5,5),
    index=['1행', '2행', '3행', '4행', '5행'],
    columns=['1열', '2열', '3열', '4열', '5열']
)
df

    1열  2열  3열  4열  5열
1행  10  11  12  13  14
2행  15  16  17  18  19
3행  20  21  22  23  24
4행  25  26  27  28  29
5행  30  31  32  33  34

In [29]:
# 1행 인덱싱
print(df.loc['1행'])

# 1행 1열 인덱싱
print(df.loc['1행', '1열'])

# 2행부터 3행까지 슬라이스
print(df.loc['2행':'3행'])

# 2행부터 3행까지 슬라이스
print(df['2행':'3행'])

# 2행과 4행 슬라이스
print(df.loc[['2행', '3행']])

# 2행 중 짝수 값만 출력
df.loc['2행', df.loc['2행'] % 2 == 0]

# 1행 3열, 4열 인덱싱
df.loc['1행', ['3열', '4열']]

# 3행 4열 인덱싱
df.iloc[2, 3]

# 3행 4열, 5열 인덱싱
df.iloc[2, 3:]

# 3행,4행,5행, 3열, 4열 인덱싱
df.iloc[2:, 2:4]

1열    10
2열    11
3열    12
4열    13
5열    14
Name: 1행, dtype: int32
10
    1열  2열  3열  4열  5열
2행  15  16  17  18  19
3행  20  21  22  23  24
    1열  2열  3열  4열  5열
2행  15  16  17  18  19
3행  20  21  22  23  24
    1열  2열  3열  4열  5열
2행  15  16  17  18  19
3행  20  21  22  23  24

    3열  4열
3행  22  23
4행  27  28
5행  32  33

## 연습문제 4.4.1
타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

In [32]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

# 각 열마다 데이터의 개수
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## 연습 문제 4.4.2
sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [50]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

# 성별 인원수
print(titanic.iloc[:,2].value_counts())

# 나이별 인원수
print(titanic.loc[:, ['age']].value_counts())

# 선실별 인원수
print(titanic.loc[:, ['class']].value_counts())

# 사망/생존 인원수
print(titanic.loc[:, ['alive']].value_counts())

male      577
female    314
Name: sex, dtype: int64
age
24.00    30
22.00    27
18.00    26
30.00    25
19.00    25
         ..
53.00     1
55.50     1
66.00     1
70.50     1
0.42      1
Length: 88, dtype: int64
class
Third     491
First     216
Second    184
dtype: int64
alive
no       549
yes      342
dtype: int64

## 연습 문제 4.4.3
1. 타이타닉호 승객의 평균 나이를 구하라.
2. 타이타닉호 승객 중 여성 승객의 평균 나이를 구하라.
3. 타이타닉호 승객 중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [71]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

# 타이타닉호 승객의 평균나이
print(titanic.loc[:, ['age']].mean())

# 타이타닉호 승객 중 여성 승객의 평균나이
# 여성 승객 데이터 추출
titanic_female = titanic.loc[titanic['sex'] == 'female']
# 여성 승객 평균 나이
print(titanic_female.loc[:, ['age']].mean())

# 타이타닉호 승객 중 1등실 선실의 여성 승객의 평균 나이
# 여성 승객 중 1등실 선실 데이터 추출
titanic_female_First = titanic_female.loc[titanic_female['class'] == 'First']
# 1등실 여성 승객 평균나이
print(titanic_female_First.loc[:, ['age']].mean())

age    29.699118
dtype: float64
age    27.915709
dtype: float64
age    34.611765
dtype: float64

## 연습 문제 4.4.4
타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.

조건 1. 20살이 넘으면 성별을 그대로 사용한다.

조건 2. 20살 미만이면 성별에 관계없이 “child”라고 한다.

In [87]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

# 각 행마다 조건을 대입하여 child나 원래 성별이 나오도록 한다. 시리즈가 반환된다.
category1 = titanic.apply(lambda x : x['sex'] if x['age'] > 20 else 'child', axis = 1)
# category1 열 추가
titanic['category1'] = category1

titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

## 연습 문제 4.4.5
타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터 프레임을 고쳐라

In [124]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

# 나이 중 NaN인 값을 나이 평균 값으로 바꾼 데이터 프레임 저장
titanic_age = titanic.loc[:,['age']].fillna(titanic['age'].mean())

# age 행을 titanic_age프레임의 age 행으로 치환
titanic['age'] = titanic_age['age']

## 연습 문제 4.4.6
타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.

1. 성별을 나타내는 문자열 male 또는 female로 시작한다.
2. 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.

예를 들어 27살 남성은 male27 값이 된다.

In [136]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

# category2 시리즈를 성별로 설정
category2 = titanic['sex']

# 나이를 문자열로 바꾼 후 category2 시리즈에 이어 붙여 재설정
category2 += titanic['age'].astype(str)

# category2 열 추가
titanic['category2'] = category2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category2
0,0,3,male22.0,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male22.0
1,1,1,female38.0,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female38.0
2,1,3,female26.0,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female26.0
3,1,1,female35.0,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female35.0
4,0,3,male35.0,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male35.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male27.0,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male27.0
887,1,1,female19.0,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,female19.0
888,0,3,femalenan,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,femalenan
889,1,1,male26.0,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male26.0
890,0,3,male32.0,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male32.0

## 연습 문제 4.4.7
타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

In [158]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

# age를 bins을 기준으로 나누어 cats 시리즈에 저장
cats = pd.cut(titanic['age'], bins, labels = labels)
# cats를 데이터프레임으로 저장
df = pd.DataFrame(cats.value_counts())

# 나이 비율을 계산한 시리즈 저장
age_percent = df.apply(lambda x : x / cats.count(), axis = 1)

# 데이터 프레임에 나이 비율 열 추가
df['나이 비율'] = age_percent

      age     나이 비율
중년    241  0.344286
청년    230  0.328571
미성년자  165  0.235714
장년     59  0.084286
노년      5  0.007143

## 연습문제 4.4.8

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.

1. 20살 미만이면 성별에 관계없이 “미성년자”라고 한다.

2. 20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

In [208]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

# age를 bins을 기준으로 나누어 cats 시리즈에 저장
cats = pd.cut(titanic['age'], bins, labels = labels)
# 나이대 열 추가
titanic['나이대'] = cats

# sex 값을 기준으로 한글 성별 시리즈 저장
sex_kor = titanic.apply(lambda x : '남성' if x['sex'] == 'male'  else '여성', axis = 1)
# 한글성별 열 추가
titanic['한글성별'] = sex_kor

# 20을 기준으로 시리즈 저장
category3 = titanic.apply(lambda x : x['나이대'] + x['한글성별'] if x['age'] >= 20 else '미성년자', axis = 1)
# category3 열 추가
titanic['category3'] = category3

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,나이대,한글성별,category3
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,청년,남성,청년남성
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,중년,여성,중년여성
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,청년,여성,청년여성
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,중년,여성,중년여성
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,중년,남성,중년남성
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,청년,남성,청년남성
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,미성년자,여성,미성년자
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN,여성,미성년자
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,청년,남성,청년남성
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,중년,남성,중년남성